//=============================================================================
//
// 3Dフィールド処理 [field.h]
// Author : HIROHIKO HAMAYA
//
//=============================================================================
#pragma once

#include "main.h"

//マクロ定義
#define FIELD_MAX	(1)
#define TREE_MAX	(50)

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitField3D(void);
void UninitField3D(void);
void UpdateField3D(void);
void DrawField3D(void);