//=============================================================================
//
// サンプル画像表示処理 [gameover.h]
// Author : HIROHIKO HAMAYA
//
//=============================================================================
#pragma once

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitGameover();
void	UninitGameover();
void	UpdateGameover();
void	DrawGameover();
void    DrawGameclear();






