//=============================================================================
//
// 数値表示処理 [number.h]
// Author : HIROHIKO HAMAYA
//
//=============================================================================
#pragma once
#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define NUMBER_SIZE_X		(35.0f)	// ポリゴンのサイズ
#define NUMBER_SIZE_Y		(50.0f)	// ポリゴンのサイズ

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitNumber();	// 初期化
void UninitNumber();	// 終了処理
void DrawNumber(		// 描画
	XMFLOAT2* pPos,					// 座標（左上起点）
	unsigned uNumber,				// 数値
	int nWidth,						// 桁数
	float fSizeX = NUMBER_SIZE_X,	// １文字の幅
	float fSizeY = NUMBER_SIZE_Y);	// １文字の高さ
