//=============================================================================
//
// タイトルシーン [sceanSetumei.h]
// Author : KATOU TAKUYA
//
//=============================================================================
#pragma once

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSceneSetumei();
void	UninitSceneSetumei();
void	UpdateSceneSetumei();
void	DrawSceneSetumei();





