//=============================================================================
//
// タイトルシーン [sceanBaSelect.h]
// Author : KATOU TAKUYA
//
//=============================================================================
#pragma once

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSceneBaSelect();
void	UninitSceneBaSelect();
void	UpdateSceneBaSelect();
void	DrawSceneBaSelect();



