//=============================================================================
//
// タイトルシーン [sceanGameover.h]
// Author : KATOU TAKUYA
//
//=============================================================================
#pragma once

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSceneGameover();
void	UninitSceneGameover();
void	UpdateSceneGameover();
void	DrawSceneGameover();

