//=============================================================================
//
// 表示処理 [selecttitle.h]
// Author : HIROHIKO HAMAYA
//
//=============================================================================
#pragma once

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSelTitle();
void	UninitSelTitle();
void	UpdateSelTitle();
void	DrawSelTitle();
void    DrawSelTitle1();




